; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	image0 - mode
	Star3 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star5 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(supports instrument2 image0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
)
(:goal (and
	(have_image Star10 image0)
	(have_image Planet11 image0)
	(have_image Planet12 image0)
	(have_image Planet13 thermograph1)
	(have_image Phenomenon14 thermograph1)
	(have_image Star15 thermograph1)
	(have_image Phenomenon16 thermograph1)
	(have_image Phenomenon17 image0)
	(have_image Star18 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation0 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
5. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon14 instrument0 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 4 of 9
12. (turn_to satellite0 planet12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet12)
   goals met: 4 of 9
13. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 9
14. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 5 of 9
15. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 6 of 9
16. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 6 of 9
17. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   goals met: 7 of 9
18. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
19. (take_image satellite0 star15 instrument0 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 8 of 9
20. (turn_to satellite0 star18 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star18)
   goals met: 8 of 9
21. (take_image satellite0 star18 instrument0 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 9 of 9
